Tekla.Structures.Dialog.FormBase.ApplyValues(System.String)
Loads the dialog values from a file and performs Tekla.Structures.Dialog.FormBase.Apply on the loaded values.
To match the files to a certain dialog, the file suffix is set as the dialog type's name.
Code calling this method should use the full path in applications.
FileName: The name of the file.

Tekla.Structures.Dialog.FormBase.LoadValues(System.String)
Loads the dialog values from a file. To match the files to a certain dialog,
the file suffix is set as the dialog type's name.
Code calling this method should use the full path in applications.
FileName: The name of the file.

Tekla.Structures.Dialog.FormBase.ModifyValues(System.String)
Loads the dialog values from a file and performs Tekla.Structures.Dialog.FormBase.Modify on the loaded values.
To match the files to a certain dialog, the file suffix is set as the dialog type's name.
Code calling this method should use the full path in applications.
FileName: The name of the file.